/*
 * MTD SPI driver for ST M25Pxx (and similar) serial flash chips
 *
 * Author: Mike Lavender, mike@steroidmicros.com
 *
 * Copyright (c) 2005, Intec Automation Inc.
 *
 * Some parts are based on lart.c by Abraham Van Der Merwe
 *
 * Cleaned up and generalized based on mtd_dataflash.c
 *
 * This code is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 */

 

#include <asm/io.h>
#include <linux/cdev.h>
#include <linux/clk.h>
#include <linux/delay.h>
#include <linux/dma-mapping.h>
#include <linux/err.h>
#include <linux/errno.h>
#include <linux/fcntl.h>
#include <linux/fs.h>
#include <linux/init.h>
#include <linux/interrupt.h>
#include <linux/ioport.h>
#include <linux/kernel.h>
#include <linux/miscdevice.h>
#include <linux/module.h>
#include <linux/platform_device.h>
#include <linux/poll.h>
#include <linux/preempt.h>
#include <linux/proc_fs.h>
#include <linux/sched.h>
#include <linux/slab.h>
#include <linux/spinlock.h>
#include <linux/spi/spi.h>
#include <linux/types.h>
#include <linux/version.h>
#include <linux/workqueue.h>

#include <linux/device.h>

#include <linux/mtd/mtd.h>
#include <linux/mtd/partitions.h>

#include <asm/uaccess.h>
#include <asm/io.h>
#include <asm/cacheflush.h>
#include <linux/spi/cnc18xx_spi.h>

/* #define DEBUG(n, args...) printk(KERN_ERR args); */

#define CONFIG_SPI_DMA

#define FLASH_PAGESIZE    256

//#define SPI_PINMUX        0x4211000c

/* Flash opcodes. */
#define OPCODE_WREN       0x06       /* Write enable                     */
#define OPCODE_RDSR       0x05       /* Read status register             */
#define OPCODE_WRSR       0x01       /* Write status register 1 byte     */
#define OPCODE_NORM_READ  0x03       /* Read data bytes (low frequency)  */
#define OPCODE_FAST_READ  0x0b       /* Read data bytes (high frequency) */
#define OPCODE_PP         0x02       /* Page program (up to 256 bytes)   */
#define OPCODE_BE_4K      0x20       /* Erase 4KiB block                 */
#define OPCODE_BE_32K     0x52       /* Erase 32KiB block                */
#define OPCODE_CHIP_ERASE 0xc7       /* Erase whole flash chip           */
#define OPCODE_SE         0xd8       /* Sector erase (usually 64KiB)     */
#define OPCODE_RDID       0x9f       /* Read JEDEC ID                    */

#define MAX_RCV_SZ        0x1000
#define RD_SZ             MAX_RCV_SZ

#define DEF_R_SPEED       0x8
#define DEF_W_SPEED       0x8

#define DEF_DMA_R_SPEED   0x4
#define DEF_DMA_W_SPEED   0x2

/* Status Register bits. */
#define SR_WIP            1    /* Write in progress                */
#define SR_WEL            2    /* Write enable latch               */
/* meaning of other SR_* bits may differ between vendors */
#define SR_BP0            4    /* Block protect 0                  */
#define SR_BP1            8    /* Block protect 1                  */
#define SR_BP2            0x10 /* Block protect 2                  */
#define SR_SRWD           0x80 /* SR write protect                 */

/* Define max times to check status register before we give up. */
#define	MAX_READY_WAIT_JIFFIES	(40 * HZ)	/* M25P16 specs 40s max chip erase */
#define	CMD_SIZE		4

#ifdef CONFIG_M25PXX_USE_FAST_READ
#define OPCODE_READ 	OPCODE_FAST_READ
#define FAST_READ_DUMMY_BYTE 1
#else
#define OPCODE_READ 	OPCODE_NORM_READ
#define FAST_READ_DUMMY_BYTE 0
#endif

typedef struct __SPI_REGS {
		u32 ctrlr0;    /*0x00           */
		u32 ctrlr1;    /*0x04           */
		u32 ssienr;    /*0x08           */
		u32 mwcr;      /*0x0C           */
		u32 ser;       /*0x10           */
		u32 baudr;     /*0x14           */
		u32 txftlr;    /*0x18           */
		u32 rxftlr;    /*0x1C           */
		u32 txflr;     /*0x20           */
		u32 rxflr;     /*0x24           */
		u32 sr;        /*0x28           */
		u32 imr;       /*0x2C           */
		u32 isr;       /*0x30           */
		u32 risr;      /*0x34           */
		u32 txoicr;    /*0x38           */
		u32 rxoicr;    /*0x3C           */
		u32 rxuicr;    /*0x40           */
		u32 msticr;    /*0x44           */
		u32 icr;       /*0x48           */
		u32 dmacr;     /*0x4c           */
		u32 dmatdlr;   /*0x50           */
		u32 dmardlr;   /*0x54           */
		u32 rsv1;      /*0x58, reserved */
		u32 rsv2;      /*0x5c, reserved */
		u32 dr;        /*0x60           */
} spi_regs_t;

/*******************************************************************
 * DMA */
#define DW_REG(name)		u32 name; u32 __pad_##name
/* Hardware register definitions. */
struct dw_dma_chan_regs {
    DW_REG(SAR);     /* Source Address Register      */
    DW_REG(DAR);     /* Destination Address Register */
    DW_REG(LLP);     /* Linked List Pointer          */
    u32 CTL_LO;      /* Control Register Low         */
    u32 CTL_HI;      /* Control Register High        */
    DW_REG(SSTAT);
    DW_REG(DSTAT);
    DW_REG(SSTATAR);
    DW_REG(DSTATAR);
    u32 CFG_LO;      /* Configuration Register Low   */
    u32 CFG_HI;      /* Configuration Register High  */
	DW_REG(SGR);
	DW_REG(DSR);
};

struct dw_dma_irq_regs {
	DW_REG(XFER);
	DW_REG(BLOCK);
	DW_REG(SRC_TRAN);
	DW_REG(DST_TRAN);
	DW_REG(ERROR);
};

#define DW_DMA_MAX_NR_CHANNELS 8
#define DW_SPI_REG_DMA         0x4000
typedef struct dw_dma_regs {
	/* per-channel registers */
